Revit 2027 API
BuiltInFailures.SketchFailures.RunNotEnoughBoundaryCurves Property
 Sketch run require boundaries (chains of one or more Boundary Lines)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RunNotEnoughBoundaryCurves { get; }
Public Shared ReadOnly Property RunNotEnoughBoundaryCurves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RunNotEnoughBoundaryCurves {
	FailureDefinitionId^ get ();
}
static member RunNotEnoughBoundaryCurves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace